In [15]:
import pandas as pd
import numpy as np

In [16]:
file = "../data/payload_mixed.csv"

In [17]:
df = pd.read_csv(file, encoding = "ISO-8859-1",on_bad_lines='skip')
df.head()

            payload  length attack_type label
0    c/ caridad s/n      14        norm  norm
1      campello, el      12        norm  norm
2             40184       5        norm  norm
3  1442431887503330      16        norm  norm
4             nue37       5        norm  norm

In [20]:
sqli_df = df[df['attack_type'] == 'sqli']
sqli_df.head()

,payload,length,attack_type,label
436,1' where 6406=6406;select count(*) from rdb$fi...,115,sqli,anom
437,1) and 8514=(select count(*) from domain.domai...,111,sqli,anom
438,-3136%') or 3400=6002,21,sqli,anom
439,1) where 7956=7956 or sleep(5)#,31,sqli,anom
440,-7387'))) order by 1--,22,sqli,anom

In [21]:
len(sqli_df)

10852

In [22]:
norm_df = df[df['attack_type'] == 'norm']
norm_df.head()

            payload  length attack_type label
0    c/ caridad s/n      14        norm  norm
1      campello, el      12        norm  norm
2             40184       5        norm  norm
3  1442431887503330      16        norm  norm
4             nue37       5        norm  norm

In [23]:
len(norm_df)

19304